## Exercise 1: Understanding .iloc[] and .loc[]
### Objective: Familiarize students with basic .iloc[] and  .loc[] operations.

In [67]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23,35,45,36,28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

## Tasks

- Task 1 Select the row with index2 using '.iloc[]

In [68]:
#Select the row with index2 using '.iloc[]
row_index2 = df.iloc[2,:]
print(row_index2)

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

- Task 2 Select the 'Age' column using '.iloc[]

In [54]:
#Select the 'Age' column using '.iloc[]
age_Column = df.iloc[:,1]
age_Column

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

- Task 3 Select the first three rows using '.iloc[]' slicing

In [55]:
#Select the first three rows using '.iloc[]' slicing
firstThreeRows = df.iloc[0:3]
firstThreeRows

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

- Task 4 Select the 'Name' and 'City' columns for the  three rows using '.iloc[]'

In [56]:
# Select the 'Name' and 'City' columns for the  three rows using '.iloc[]'
nameCityFirstThree = df.iloc[[0,1,2],[0,2]]
nameCityFirstThree

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

- Task 5 Select the row for 'Chalie' using '.loc[]'

In [57]:
# Select the row for Chalie using '.loc[]'
rowChalie = df.loc[2]
rowChalie

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

- Task 6 Select the 'Age' column using '.loc[]'

In [58]:
# Task 6 Select the 'Age' column using '.loc[]'
ageColumn = df.loc[:,'Age']
ageColumn

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

- Task 7 Select the 'City' column for 'Bob' and 'Eva' using '.loc[]'

In [59]:
# Select the 'City' column for 'Bob' and 'Eva' using '.loc[]'
cityForBobAndEva = df.loc[[1,4],['City']]
cityForBobAndEva

          City
1  Los Angeles
4      Phoenix

## Exercise 2:  Advanced Indexing
### Objective: Practice more complex .iloc[] and .loc[] operations including conditional selection.

- Task 1 Select the rows where 'Age' is greater than 30 using '.loc[]'

In [60]:
# Select the rows where 'Age' is greater than 30 using .loc[]
ageGreaterThan30 = df.loc[df['Age']> 30]
ageGreaterThan30

      Name  Age         City
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston

- Task 2 Select the rows where 'City' is either 'Chicago' or 'Houston' using '.loc[]'

In [61]:
# Select the rows where 'City' is either 'Chicago' or 'Houston' using '.loc[]'
cityChiHouston = df.loc[df['City'].isin(['Chicago','Houston'])]
cityChiHouston

      Name  Age     City
2  Charlie   45  Chicago
3    David   36  Houston

- Task 3 Change the index of the DataFrame to be the 'Name' column and then use '.loc[]' to select 'David'

In [62]:
# Change the index of the DataFrame to be the 'Name' column and then use '.loc[]' to select 'David'

# Set 'Name' column as the index
df_inplace = df.set_index('Name', inplace=False)

# Select row where the index is 'David' using .loc[]
result = df_inplace.loc['David']
result

Age          36
City    Houston
Name: David, dtype: object

In [65]:
#Display the original datafroame
df

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [66]:
#Display the new datafroame with name as index
df_inplace

         Age         City
Name
Alice     23     New York
Bob       35  Los Angeles
Charlie   45      Chicago
David     36      Houston
Eva       28      Phoenix

- Task 4 Select the 'Age' and  'City' Columns for 'Bob' and 'Eva' using '.loc[]' after setting the index to 'Name'

In [69]:
# Select the 'Age' and  'City' Columns for 'Bob' and 'Eva' using '.loc[]' after setting the index to 'Name'
ageAndCity = df_inplace.loc[['Bob','Eva'],['Age','City']]
ageAndCity

      Age         City
Name
Bob    35  Los Angeles
Eva    28      Phoenix

##  Exercise 3: Practical Application
### Objective: Apply .iloc[] and .loc[] in a more realistic scenario.

In [70]:
data = {
    'Product': ['Apple', 'Banana', 'Carrot', 'Doughnut', 'Egg'],
    'Price': [0.5, 0.3, 0.4, 1.0, 0.2],
    'In Stock': [True, True, False, True, False]
}
df = pd.DataFrame(data)
print(df)

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

- Task 1: Select the products that are in stock using '.loc[]'

In [72]:
# Select the products that are in stock using '.loc[]'
productInStock = df.loc[df['In Stock'] == True]
productInStock

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
3  Doughnut    1.0      True

In [74]:
# Select only the 'Product' column
product_names = df.loc[df['In Stock'], 'Product']
product_names

0       Apple
1      Banana
3    Doughnut
Name: Product, dtype: object

- Task 2 Update the price of 'Doughnut' to 1.2 using '.loc[]'

In [90]:
data = {
    'Product': ['Apple', 'Banana', 'Carrot', 'Doughnut', 'Egg'],
    'Price': [0.5, 0.3, 0.4, 1.0, 0.2],
    'In Stock': [True, True, False, True, False]
}
df = pd.DataFrame(data)
# Update the price of 'Doughnut' to 1.2 without affecting other prices
df.loc[df['Product'] == 'Doughnut', 'Price'] = 1.2
df

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.2      True
4       Egg    0.2     False

- Task 3 Select all products with a price less than 0.5 using '.loc[]'

In [91]:
# Select products with a price less than 0.5 using .loc[]
selected_products = df.loc[df['Price'] < 0.5]
selected_products

  Product  Price  In Stock
1  Banana    0.3      True
2  Carrot    0.4     False
4     Egg    0.2     False

- Task 4 Select the 'Product' and 'Price' columns for items that are not in stock using '.loc[]'

In [92]:
# Select 'Product' and 'Price' columns for items that are not in stock using .loc[]
not_in_stock_items = df.loc[~df['In Stock'], ['Product', 'Price']]
not_in_stock_items

  Product  Price
2  Carrot    0.4
4     Egg    0.2